---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GenericFailures.ElementsInInvalidContext
source: html/6f43478f-c706-7324-ad81-eb4b97f902d2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GenericFailures.ElementsInInvalidContext Property

There are elements in the document that exist in a context they should not. These elements must be deleted to continue using this project or family.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementsInInvalidContext { get; }
```